The goal of this challenge is to build a model that predicts conversion rate and, based on the model, come up with ideas to improve revenue.

In [3]:
# import modules
import pandas as pd
import numpy as np

In [7]:
# read data
conversion_data = pd.read_csv('/Users/kexinluo/Desktop/DS_take_home/1.conversion/conversion_data.csv')
conversion_data.head()

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0
3   China   39         1    Seo                    5          0
4      US   30         1    Seo                    6          0

In [14]:
print(conversion_data.info())
# check for any missing values
print('\n------------------------')
print('count of missing values of each column')
conversion_data.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 316200 entries, 0 to 316199
Data columns (total 6 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   country              316200 non-null  object
 1   age                  316200 non-null  int64
 2   new_user             316200 non-null  int64
 3   source               316200 non-null  object
 4   total_pages_visited  316200 non-null  int64
 5   converted            316200 non-null  int64
dtypes: int64(4), object(2)
memory usage: 14.5+ MB
None

------------------------
count of missing values of each column

country                0
age                    0
new_user               0
source                 0
total_pages_visited    0
converted              0
dtype: int64

In [16]:
# summary statistics of each column
conversion_data.describe()
# max age is likely wrong, need to check age ranges and distributions

                 age       new_user  total_pages_visited      converted
count  316200.000000  316200.000000        316200.000000  316200.000000
mean       30.569858       0.685465             4.872966       0.032258
std         8.271802       0.464331             3.341104       0.176685
min        17.000000       0.000000             1.000000       0.000000
25%        24.000000       0.000000             2.000000       0.000000
50%        30.000000       1.000000             4.000000       0.000000
75%        36.000000       1.000000             7.000000       0.000000
max       123.000000       1.000000            29.000000       1.000000

In [ ]:
# for each column, find count of unique values and print the top 5 unique values
for column in conversion_data.columns:
    uniques = sorted(conversion_data[column].unique())
    print('{0:20s} {1:5d}\t'.format(column, len(uniques)), uniques[:5])